--Керівник складу просить топ-10 товарів, які зараз фізично є на складі, найбільших за сумарною вартістю запасу 
--У результаті має бути видно назву товару, ціну, кількість на складі і підсумкову вартість
USE Northwind;
GO
SELECT TOP 10
	ProductName AS [Назва товару],
	UnitPrice AS [Ціна одиниці товару, грн],
	UnitsInStock AS [Кількість на складі, шт.],
	UnitPrice*UnitsInStock AS [Підсумкова вартість, грн]
FROM Products	
WHERE UnitsInStock > 0
ORDER BY [Підсумкова вартість, грн] DESC;