--Northwind, Products: порівняти в одному запиті AVG по UnitsOnOrder і AVG з захистом через ISNULL
USE Northwind;
GO
SELECT
	AVG(UnitsOnOrder) AS var_1, --знаменник буде менше, якщо є NULL. Може завищити результат
	AVG(ISNULL(UnitsOnOrder,0)) AS var_2 --замість NULL в знаменник порахує 0, точніше. Може занизити результат
FROM Products;

--Яка середня кількість одиниць у замовленні серед тих товарів, які зараз замовляють? — Варіант 1
--Яке середнє значення замовлень за всією лінійкою товарів (включаючи ті, які ніхто не замовляв)- Варіант 2