-- Підготувати звіт для директора: по кожному менеджеру і кожному року, де менеджер оформив хоча б 10 замовлень, показати кількість замовлень і класифікацію навантаження: 
-- "Висока активність" (50+), "Середнє" (25–49), "Низьке" (менше 25 замовлень). Сортування за роком і кількістю замовлень
USE Northwind;
GO
SELECT
	EmployeeID [ID менеджера],
	YEAR(OrderDate) AS [Рік],
	COUNT(*) AS [Кількість замовлень],
	CASE                                        -- умови класифікації по навантаженню для вже відфільтрованих груп
		WHEN COUNT(*) < 25 THEN 'Низьке'
		WHEN COUNT(*) BETWEEN 25 AND 49 THEN 'Середнє'
		ELSE 'Висока активність'
	END AS [Навантаження]
FROM Orders
GROUP BY EmployeeID, YEAR(OrderDate)			-- по кожному менеджеру і кожному року
HAVING COUNT(*) >= 10							-- хоча б 10 замовлень
ORDER BY [Рік],[Кількість замовлень];           -- сортувати за аліасом 