--Потрібен детальний звіт по регіонах доставки за 1997 рік: для кожної пари країна + місто доставки порахувати кількість замовлень і загальний фрахт.
--Відсортувати за країною по алфавіту, потім за кількістю замовлень від найбільших
USE Northwind;
GO
SELECT
	ShipCountry AS [Країна],
	ShipCity AS [Місто],
	COUNT(*) AS [Кількість замовлень],
	SUM(Freight) AS [Загальний фрахт]
FROM Orders
WHERE OrderDate>='1997-01-01' AND OrderDate<'1998-01-01'
GROUP BY ShipCountry,ShipCity
ORDER BY [Країна],[Кількість замовлень] DESC;
